glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_K60_DFP.pdsc
    <!-- Startup MK61F15 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK61F15 CMSIS">
      <description>System Startup for NXP MK61F15 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK61F15.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK61F15.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MK63F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK63F12 CMSIS">
      <description>System Startup for NXP MK63F12 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK63F12.s" attr="config" version="2.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK63F12.c"      attr="config" version="2.3.0"/>
      </files>
    </component>
    <!-- Startup MK64F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK64F12 CMSIS">
      <description>System Startup for NXP MK64F12 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK64F12.s" attr="config" version="2.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK64F12.c"      attr="config" version="2.3.0"/>
      </files>
    </component>
    <!-- Startup MK65F18 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="MK65F18 CMSIS">
      <description>System Startup for NXP MK65F18 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK65F18.s" attr="config" version="3.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK65F18.c"      attr="config" version="3.0.0"/>
        <file category="header"  name="Device/Source/system_MK65F18.h"      attr="config" version="3.0.0"/>
      </files>
    </component>
    <!-- Startup MK66F18 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="MK66F18 CMSIS">
      <description>System Startup for NXP MK66F18 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK66F18.s" attr="config" version="3.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK66F18.c"      attr="config" version="3.0.0"/>
        <file category="header"  name="Device/Source/system_MK66F18.h"      attr="config" version="3.0.0"/>
      </files>
    </component>
  </components>

  <boards>
    <board name="FRDM-K64F" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MK64FN1M0xxx12"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MK64FX512xxx12"/>
      <description>
The Freedom-K64F is an ultra-low-cost development platform for Kinetis K64, K63, and K24 MCUs.
 - Form-factor compatible with the Arduino R3 pin layout
 - Peripherals enable rapid prototyping, including a 6-axis digital accelerometer and magnetometer to create full eCompass capabilities, a tri-colored LED and 2 user push-buttons for direct interaction, a microSD card slot, and connectivity using onboard Ethernet port and headers for use with Bluetooth® and 2.4 GHz radio add-on modules
 - OpenSDAv2, the NXP open source hardware embedded serial and debug adapter running an open source bootloader, offers options for serial communication, flash programming, and run-control debugging
      </description>
      <book category="overview"  name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/freedom-development-boards/freedom-development-platform-for-kinetis-k64-k63-and-k24-mcus:FRDM-K64F" title="FRDM-K64F Web Page"/>
      <book category="setup"     name="Boards/NXP/FRDM-K64F/Documents/FRDMK64QSG.pdf"    title="Quick Start Guide"/>
      <book category="schematic" name="Boards/NXP/FRDM-K64F/Documents/FRDM-K64F_SCH.pdf" title="FRDM-K64F Schematics"/>
      <book category="manual"    name="Boards/NXP/FRDM-K64F/Documents/FRDMK64FUG.pdf"    title="User Manual"/>
      <feature type="ODbg"          n="1"              name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"           n="5"              name="USB Powered"/>
      <feature type="MemCard"       n="1"              name="Micro SD Card holder"/>
      <feature type="USB"           n="1"              name="Micro-AB USB connector"/>
      <feature type="USB"           n="1"              name="OpenSDAv2 Micro USB connector"/>
      <feature type="ETH"           n="1"              name="10/100 Ethernet Port"/>
      <feature type="Button"        n="3"/>
      <feature type="Accelerometer" n="1"              name="NXP FXOS8700CQ low-power, six-axis Xtrinsic sensor"/>
      <feature type="DIO"           n="8"              name="nRF24L01+ Nordic 2.4G Radio module expansion pins"/>
      <feature type="DIO"           n="4"              name="JY-MCU BT board V1.05 BT module expansion pins"/>
      <feature type="DIO"           n="33"             name="Digital IOs"/>
      <feature type="AIO"           n="9"              name="Analog IOs"/>
      <feature type="LED"           n="1"              name="RGB LED"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="SDA 10 pin Cortex debug (0.05 inch connector)"/>
    </board>

    <board name="TWR-K60D100M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MK60DN512xxx10"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="K60 Series"/>
      <description>
The TWR-K60D100M is a development tool for the 100 MHz K60, K20, and K10 families of Kinetis microcontrollers.
The TWR-K60D100M operates as a standalone debug tool and can also be combined and used as part of the modular Tower System development platform.
      </description>
      <image small="Boards/NXP/TWR-K60D100M/Documents/TWR-K60D100M_small.PNG"
             large="Boards/NXP/TWR-K60D100M/Documents/TWR-K60D100M_large.PNG"/>
      <book category="overview"  name="http://www.nxp.com/products/microcontrollers-and-processors/arm-processors/kinetis-cortex-m-mcus/k-series-performance-m4/k6x-ethernet/kinetis-k60-100-mhz-mcu-tower-system-module:TWR-K60D100M" title="TWR-K60D100M Web Page"/>
      <book category="setup"     name="Boards/NXP/TWR-K60D100M/Documents/TWR-K60D100MQSG.pdf"  title="Quick Start Guide"/>
      <book category="schematic" name="Boards/NXP/TWR-K60D100M/Documents/TWR-K60D100M_SCH.pdf" title="Schematic"/>
      <book category="manual"    name="Boards/NXP/TWR-K60D100M/Documents/TWRK60D100MUM.pdf"    title="User Manual"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Batt"      n="1"              name="Battery holder for 20mm lithium battery (e.g. 2032, 2025)"/>
      <feature type="MemCard"   n="1"              name="SD Card holder"/>
      <feature type="USB"       n="1"              name="High-Speed USB Mini-B Connector"/>
      <feature type="ConnOther" n="1"              name="Touch Tower Plug-in Socket"/>
      <feature type="ConnOther" n="1"              name="General purpose Tower Plug-in (TWRPI) socket"/>
      <feature type="ConnOther" n="2"              name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="Poti"      n="1"/>
      <feature type="Button"    n="2"/>
      <feature type="Touch"     n="4"/>
      <feature type="Accelerometer" n="1"          name="Three axis accelerometer (MMA78451Q)"/>
      <feature type="LED"       n="4"              name="Four user-controlled status LEDs"/>
      <feature type="TowerFF"   n="1"/>
    </board>

