glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_K60_DFP.pdsc
    <board name="TWR-K64F120M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MK64FN1M0xxx12"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MK64FX512xxx12"/>
      <description>
The NXP TWR-K64F120M is a development board for the Kinetis K24, K63 and K64 120 MHz 32-bit ARM® Cortex®-M4 MCUs.
 - The TWR-K64F120M features the Kinetis MK64FN1M0VMD12 low-power MCU with 1 MB Flash, 256 KB SRAM, USB USB and Ethernet MAC.
 - It operates as a standalone debug tool and can also be combined and used as part of the modular Tower System development platform
      </description>
      <image small="Boards/NXP/TWR-K64F120M/Documents/TWR-K64F120M_small.png"
             large="Boards/NXP/TWR-K64F120M/Documents/TWR-K64F120M_large.png"/>
      <book category="overview"  name="http://www.nxp.com/products/sensors/accelerometers/3-axis-accelerometers/kinetis-k64-mcu-tower-system-module:TWR-K64F120M" title="TWR-K64F120M Web Page"/>
      <book category="setup"     name="Boards/NXP/TWR-K64F120M/Documents/TWRK64FQSG.pdf" title="Quick Start Guide"/>
      <feature type="ODbg"      n="1"              name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Batt"      n="1"              name="Battery holder for 20mm lithium battery (e.g. 2032, 2025)"/>
      <feature type="MemCard"   n="1"              name="SD Card holder"/>
      <feature type="USB"       n="1"              name="Dual-role USB interface with Micro-AB USB connector"/>
      <feature type="ConnOther" n="1"              name="General purpose Tower Plug-in (TWRPI) socket"/>
      <feature type="ConnOther" n="2"              name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="Poti"      n="1"/>
      <feature type="Button"    n="2"/>
      <feature type="Touch"     n="4"/>
      <feature type="Accelerometer" n="1"          name="Three axis accelerometer (MMA78451Q)"/>
      <feature type="LED"       n="4"              name="Four user-controlled status LEDs"/>
      <feature type="TowerFF"   n="1"/>
    </board>

    <board name="TWR-K65F180M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MK65FN2M0xxx18"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MK65FX1M0xxx18"/>
      <description>
The TWR-K65F180M is a development board for the Kinetis K26, K65 and K66 180 MHz 32-bit ARM® Cortex™-M4 MCUs. It features the Kinetis MK65FN2M0VMI18 low-power MCU with 2MB Flash, 256 KB SRAM, SDRAM Controller, HS USB and Ethernet MAC.
The TWR-K65F180M operates as a standalone debug tool and can also be combined and used as part of the modular Tower System development platform.
      </description>
      <book category="overview"  name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/tower-development-boards/mcu-and-processor-modules/kinetis-modules/kinetis-k65-mcu-tower-system-module-for-kinetis-k26-k65-and-k66-mcus:TWR-K65F180M" title="TWR-K65F180M Web Page"/>
      <feature type="ODbg"          n="1"              name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"           n="5"              name="USB Powered"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="SDA 10 pin Cortex debug (0.05 inch connector)"/>
    </board>

    <board vendor="Keil" name="MCBTWRK60" revision="v1" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCBTWRK60=ON">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MK60DN512xxx10"/>
      <description>Keil MCBTWRK60 Board Support</description>
      <image small="Boards/NXP/TWR-K60D100M/Documents/mcbtwrk60_small.jpg"
             large="Boards/NXP/TWR-K60D100M/Documents/mcbtwrk60_big.jpg"/>
      <book category="overview"  name="http://www.keil.com/MCBTWRK60/"                                           title="MCBTWRK60 Web Page"/>
      <book category="schematic" name="Boards/NXP/TWR-K60D100M/Documents/mcbtwrk60_k60n512_schematics.pdf" title="Schematics"/>
      <book category="manual"    name="Boards/NXP/TWR-K60D100M/Documents/mcbtwrk60.chm"                    title="User Manual" />
      <feature type="XTAL"      n="50000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="3"              name="Push-buttons: Reset, 2 GPIO"/>
      <feature type="LED"       n="8"              name="LEDs: Power, TPWR, Status, Reset, 4x User"/>
      <feature type="USB"       n="1"              name="USB Device Interface"/>
      <feature type="USB"       n="1"              name="USB Host/OTG"/>
      <feature type="ETH"       n="1"/>
      <feature type="MemCard"   n="1"              name="SD Card Interface"/>
      <feature type="Poti"      n="1"/>
      <feature type="RS232"     n="1"/>
      <feature type="CAN"       n="1"/>
      <feature type="PressSens" n="4"/>
      <feature type="ConnOther" n="1"              name="JTAG Interface"/>
      <feature type="ConnOther" n="1"              name="ETM Interface"/>
      <feature type="ConnOther" n="1"              name="Cortex Debug &amp; Trace Interface"/>
      <feature type="CustomFF"  n="90"  m="90"/>
      <feature type="Curr"      n="280" m="300"/>
    </board>
  </boards>

  <examples>
    <!-- FRDM-K64F Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/NXP/FRDM-K64F/Blinky">
      <description>Blinky example</description>
      <board name="FRDM-K64F" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/FRDM-K64F/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-K64F" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-K60D100M Development Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-K60D100M/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-K60D100M" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

